online_results/chunked_prefill_results/opt-2.7b/_256__2000/log_15776570.out
WARNING 02-18 12:03:40 _custom_ops.py:19] Failed to import from vllm._C with ModuleNotFoundError("No module named 'vllm._C'")
Namespace(backend='openai', base_url=None, host='localhost', port=53629, endpoint='/v1/completions', dataset=None, dataset_name='sharegpt', dataset_path='/gpfs/scratch/bsc98/bsc098069/llm_benchmarking/data/dummy_dataset_mean.json', model='/gpfs/scratch/bsc98/bsc098069/llm_benchmarking/models/opt/opt-2.7b', tokenizer=None, best_of=1, use_beam_search=False, num_prompts=2000, logprobs=None, request_rate=inf, seed=0, trust_remote_code=False, disable_tqdm=True, profile=False, save_result=True, metadata=None, result_dir='online_results/chunked_prefill_results/opt-2.7b/_256__2000', result_filename=None, ignore_eos=False, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', launch_server=True, server_args='--port=53629 --enable-chunked-prefill --disable-log-requests --model=/gpfs/scratch/bsc98/bsc098069/llm_benchmarking/models/opt/opt-2.7b --max-num-seqs=256', launch_server_with_nsight=False, disable_log_stats=False, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=1024, random_output_len=128, random_range_ratio=1.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None)
Server started
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf
============ Serving Benchmark Result ============
Successful requests:                     2000      
Benchmark duration (s):                  74.49     
Total input tokens:                      484000    
Total generated tokens:                  452000    
Request throughput (req/s):              26.85     
Output token throughput (tok/s):         6068.27   
Total Token throughput (tok/s):          12566.16  
---------------Time to First Token----------------
Mean TTFT (ms):                          33389.46  
Median TTFT (ms):                        33284.44  
P99 TTFT (ms):                           68643.46  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          37.97     
Median TPOT (ms):                        39.72     
P99 TPOT (ms):                           40.69     
---------------Inter-token Latency----------------
Mean ITL (ms):                           37.97     
Median ITL (ms):                         37.53     
P99 ITL (ms):                            202.66    
==================================================
Concurrent checker terminated
Server terminated